Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>НоменклатураТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетноеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвиженияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураСПР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураТНоменклатураПриИзменении(Элемент)
    СТЧ = Элементы.НоменклатураТ.ТекущиеДанные;

    Если СТЧ.Номенклатура = Неопределено Тогда
        СТЧ.УчетноеКоличество = 0;
        СТЧ.Разница = 0;
        Возврат;
    КонецЕсли;

    Остаток = ПолучитьОстатокНоменклатурыНаСервере(СТЧ.Номенклатура);
    СТЧ.УчетноеКоличество = Остаток;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьОстатокНоменклатурыНаСервере(Номенклатура)
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   КоличествоОстаток
    |ИЗ
    |   РегистрНакопления.ДвиженияТоваров.Остатки(&Дата) КАК ДвиженияТоваров
    |ГДЕ
    |   ДвиженияТоваров.НоменклатураР = &НоменклатураР";

    Запрос.УстановитьПараметр("Дата", ТекущаяДата());
    Запрос.УстановитьПараметр("НоменклатураР", Номенклатура);

    Результат = Запрос.Выполнить().Выгрузить();

    Если Результат.Количество() > 0 Тогда
        Возврат Результат[0].КоличествоОстаток;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НоменклатураТНовоеКоличествоПриИзменении(Элемент)
    СТЧ = Элементы.НоменклатураТ.ТекущиеДанные;
    СТЧ.Разница = СТЧ.ФактическоеКоличество - СТЧ.УчетноеКоличество;
КонецПроцедуры
